//====================================================//
// ファイル名   : DefaultAssetManager.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/10/17
//
// 概要 : デフォルトアセットの管理をするクラス
//
// 更新履歴 :
// 2026/10/17 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//

#include "Assets/Managers/AssetContext.h"
#include "Assets/Types/Texture.h"

namespace RHEngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class DefaultAssetManager
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// アセットマネージャー
		AssetContext& m_assetContext;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		DefaultAssetManager(AssetContext& assetContext)
			: m_assetContext{ assetContext }
		{
		}
		~DefaultAssetManager() = default;

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// デフォルトアセットの作成と登録を行う関数
		void CreateAndRegister();

	private:

		// テクスチャアセットの生成をする関数
		std::unique_ptr<Texture> CreateTextureAsset(const unsigned char* data, const unsigned int size);
	};
}
