//====================================================//
// ファイル名   : AudioClip.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/27
//
// 概要 : 音のアセット
//
// 更新履歴 :
// 2026/07/27 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include <memory>
#include <Audio.h>

#include "Assets/Objects/AssetBase.h"

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class AudioClip : public AssetBase
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// 音ファイル
		std::unique_ptr<DirectX::SoundEffect> m_soundEffect;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		AudioClip(std::unique_ptr<DirectX::SoundEffect> soundEffect)
			: m_soundEffect{ std::move(soundEffect) }
		{
		}
		~AudioClip() = default;

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		DirectX::SoundEffect* Get() const { return m_soundEffect.get(); }
	};
}	// namespace REngine
