//====================================================//
// ファイル名   : Model.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/27
//
// 概要 : 
//
// 更新履歴 :
// 2026/07/27 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include <memory>
#include <model.h>
#include "Assets/Objects/AssetBase.h"

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class Model : public AssetBase
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// ShaderResourceView
		std::unique_ptr<DirectX::Model> m_model;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		Model(std::unique_ptr<DirectX::Model> model)
			: m_model{ std::move(model) }
		{}
		~Model() = default;

		// モデルを取得する関数
		DirectX::Model* Get() const { return m_model.get(); }
	};
}
