//====================================================//
// ファイル名   : Prefab.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/27
//
// 概要 : プレハブ
//
// 更新履歴 :
// 2026/07/27 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include <memory>
#include <filesystem>
#include "Assets/Objects/AssetBase.h"

namespace REngine
{
	class PrefabImpl;

	//====================================================//
	// クラス宣言
	//====================================================//
	class Prefab : public AssetBase
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// Impl
		std::unique_ptr<PrefabImpl> m_impl;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		Prefab(std::filesystem::path path);
		~Prefab() = default;

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// Implのゲッター
		PrefabImpl* GetImpl() const { return m_impl.get(); }
	};
}	// namespace REngine
