//====================================================//
// ファイル名   : InfoWindow.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/07
//
// 概要 : 情報を表示するウィンドウ
//
// 更新履歴 :
// 2026/07/07 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include <functional>

namespace REngine
{
	class Scene;
	class EditGUI;
	class AssetManager;

	//====================================================//
	// クラス宣言
	//====================================================//
	class InfoWindow
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// シーンポインタ
		Scene* m_pScene;

		// GUIポインタ
		EditGUI* m_pGUI;

		// 再生関数
		std::function<void()> m_playFunc;

		// アセットマネージャー
		AssetManager& m_assetManager;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		InfoWindow(AssetManager& as, Scene* pScene, EditGUI* pGUI, std::function<void()> playFunc)
			: m_pScene{ pScene }
			, m_pGUI{ pGUI }
			, m_playFunc{ playFunc }
			, m_assetManager{ as }
		{}
		~InfoWindow() = default;

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// 描画
		bool DrawInfo();

	private:

		//-----------------------------------------------------
		// 内部実装
		//-----------------------------------------------------

		bool StartInfo();

		// 描画
		void Draw();

		// 保存
		void Save();

		// ロード
		void Load();
	};
}	// namespace REngine
