//====================================================//
// ファイル名   : RangeTester.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/10/23
//
// 概要 : 範囲プロパティのテストコンポーネント
//
// 更新履歴 :
// 2026/10/23 新規作成
//====================================================//

#pragma once

#define IS_COMPONENT(RangeTester)

//====================================================//
// インクルードファイル
//====================================================//
#include "Components/World/WorldComponentBase.h"

//====================================================//
// クラス宣言
//====================================================//
class RangeTester : public RHEngine::WorldComponentBase
{
private:

	//-----------------------------------------------------
	// メンバ変数
	//-----------------------------------------------------

	RHEngine::Range m_range;

public:

	//-----------------------------------------------------
	// コンストラクタ / デストラクタ
	//-----------------------------------------------------
	RangeTester(RHEngine::IComponentOwner* own);
	~RangeTester() = default;

	//-----------------------------------------------------
	// Type
	//-----------------------------------------------------
	
	COMPONENT_TYPE(RangeTester, RHEngine::WorldComponentBase);
	
	//-----------------------------------------------------
	// 公開関数
	//-----------------------------------------------------

	void Start() override;

	void Update(const RHEngine::GameTimer& gameTimer) override;
};
