//====================================================//
// ファイル名   : GameInitializer.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/06/28
//
// 概要 : ゲームの初期化をまとめたクラス
//
// 更新履歴 :
// 2026/06/28 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class GameInitializer
{
private:
	// 初期化済みフラグ
	bool m_isInitialized;

public:
	GameInitializer()
		: m_isInitialized{ false }
	{
	}

	~GameInitializer() = default;

	// 初期化関数
	static void Initialize();

	static void RegistFactries();
};
