//====================================================//
// ファイル名   : Collider.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/06
//
// 概要 : 3次元コライダー
//
// 更新履歴 :
// 2026/05/06 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "BaseCollider.h"

//====================================================//
// クラス宣言
//====================================================//

template<typename T, ComponentID ID, bool Main = false>
class Collider : public BaseCollider
{
public:
    //-----------------------------------------------------
    // 定数
    //-----------------------------------------------------

    static constexpr ComponentID TYPE_ID = ID;
    static constexpr bool IS_MAIN = Main;

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    Collider(IComponentOwner* own, ColliderType type)
        : BaseCollider(own, type, TYPE_ID, IS_MAIN)
    {
    };
    virtual ~Collider() = default;
};