//====================================================//
// ファイル名   : CircleCollider2D.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/04/17
//
// 概要 : 2Dの円衝突クラス
//
// 更新履歴 :
// 2026/04/17 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "../ColliderBase2D.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class CircleCollider2D : public ColliderBase2D
{
private:

	//-----------------------------------------------------
	// メンバ変数
	//-----------------------------------------------------

	// 半径
	float m_radius;
public:

	//-----------------------------------------------------
	// 生成 / 破棄
	//-----------------------------------------------------
	CircleCollider2D(IComponentOwner* own)
		: ColliderBase2D(own)
		, m_radius{ 0.5f }
	{
	};
	~CircleCollider2D() = default;

	//-----------------------------------------------------
	// ゲッター
	//-----------------------------------------------------

	// ID取得
	unsigned int GetID() override
	{
		return TypeIDGenerator::GetID<CircleCollider2D>();
	}

	float GetRadius() const
	{
		return m_radius;
	}

	//-----------------------------------------------------
	// セッター
	//-----------------------------------------------------
	void SetRadius(float rad)
	{
		m_radius = rad;
		SetDirty();
	}

	void UpdateCache() const override;
};