//====================================================//
// ファイル名   : DebugRenderer.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/06/28
//
// 概要 : デバッグ描画関数群
//
// 更新履歴 :
// 2026/06/28 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Components/World/Collider/2D/ColliderBase2D.h"
class Renderer;

//====================================================//
// クラス宣言
//====================================================//

namespace DrawCollider2D
{
	// 凸多角形
	void DrawCollider_Convex(ColliderBase2D* collider, Renderer& renderer, int color);
}
