//====================================================//
// ファイル名   : VertexElementInfo.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/09/24
//
// 概要 : 入力レイアウトを作るための頂点情報をまとめた構造体
//
// 更新履歴 :
// 2026/09/24 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include <string>
#include <dxgiformat.h>

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//

	struct VertexElementInfo
	{
		std::string semanticName;		// セマンティック名	
		unsigned int semanticIndex;		// セマンティックインデックス 同名セマンティックが複数ある場合の識別用番号
		DXGI_FORMAT format;				// CPU側のメモリフォーマット
		unsigned int byteOffset;		// バイトオフセット 基本的にoffsetofマクロを使って計算
		unsigned int inputSlot = 0;		// VertexBufferのスロット番号
	};
}
