//====================================================//
// ファイル名   : Enemy2DMoveState.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/06/23
//
// 概要 : 敵の2D移動ステート
//
// 更新履歴 :
// 2026/06/23 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "../EnemyStateBase.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class Enemy2DMoveState : public EnemyStateBase
{
	//-----------------------------------------------------
	// メンバ変数宣言
	//-----------------------------------------------------
private:

	// 目標地点
	DirectX::SimpleMath::Vector2 m_targetPosition;

	// 移動するベクトル
	DirectX::SimpleMath::Vector2 m_moveVec;

	//-----------------------------------------------------
	// 関数宣言
	//-----------------------------------------------------

	// コンストラクタ
public:
	Enemy2DMoveState(Enemy* owner)
		: EnemyStateBase(owner)
		, m_targetPosition{ 0, 0 }
		, m_moveVec{ 0, 0 }
	{}

	// Stateの純粋仮想関数の実装
public:
	void Enter() override;

	void Update(const GameTimer& timer) override;

	void Exit() override;
};