//====================================================//
// ファイル名   : AStarPathFinder.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/06/17
//
// 概要 : 敵の経路をNavigationGraphとA*アルゴリズムを使って作成するクラス
//
// 更新履歴 :
// 2026/06/17 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include <queue>

#include "NavigationGraph.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class AStarPathFinder
{
    // 調べるノード
    struct SearchNode
    {
        // 各コスト値
        float g = FLT_MAX;
        float h = 0;

        // 親のインデックス
        size_t parent = 0;
        size_t parentEdge = 0;

        // リストにいるかどうかのフラグ
        bool isOpen = false;
        bool isClose = false;
    };

    // オープンリストに格納する用の構造体
    struct OpenItem
    {
        size_t nodeIndex;
        float f;

        bool operator<(const OpenItem& other) const
        {
            // priority_queueは大きいものが先頭になるので逆にする
            return f > other.f;
        }
    };

private:

    //-----------------------------------------------------
    // 定数
    //-----------------------------------------------------


    //-----------------------------------------------------
    // メンバ変数
    //-----------------------------------------------------

    // オープンリスト
    static std::priority_queue<OpenItem> m_openNodes;

    // ノードリスト
    static std::vector<SearchNode> m_nodes;

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    AStarPathFinder() = default;
    ~AStarPathFinder() = default;

    //-----------------------------------------------------
    // 公開関数
    //-----------------------------------------------------

    static std::vector<NavigationGraph::Edge> MakePath(const NavigationGraph& nav, size_t start, size_t goal);

private:

    //-----------------------------------------------------
    // 内部実装
    //-----------------------------------------------------

    // 
};