//====================================================//
// ファイル名   : ReferenceTester.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/08/30
//
// 概要 : オブジェクトの参照をテストするコンポーネント
//
// 更新履歴 :
// 2026/08/30 新規作成
//====================================================//

#pragma once

#define IS_COMPONENT(ReferenceTester)

//====================================================//
// インクルードファイル
//====================================================//
#include "Components/World/WorldComponentBase.h"
#include "Common/ObjectReference.h"
#include "Components/World/Transform/Transform.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class ReferenceTester : public RHEngine::WorldComponentBase
{
private:

	//-----------------------------------------------------
	// 定数
	//-----------------------------------------------------


	//-----------------------------------------------------
	// メンバ変数
	//-----------------------------------------------------

	RHEngine::Ref<RHEngine::Transform> m_targetTransform;

	DirectX::SimpleMath::Vector3 m_tarrgetSetPos;

public:

	//-----------------------------------------------------
	// コンストラクタ / デストラクタ
	//-----------------------------------------------------
	ReferenceTester(RHEngine::IComponentOwner* own);
	~ReferenceTester() = default;

	//-----------------------------------------------------
	// Type
	//-----------------------------------------------------
	
	COMPONENT_TYPE(EasingTestComponent, RHEngine::WorldComponentBase)

	//-----------------------------------------------------
	// 公開関数
	//-----------------------------------------------------

	void Awake() override;
	void Start() override;

	void Update(const RHEngine::GameTimer& gameTimer) override;
	void LateUpdate(const RHEngine::GameTimer& gameTimer) override;

	//-----------------------------------------------------
	// ゲッター
	//-----------------------------------------------------

	//-----------------------------------------------------
	// セッター
	//-----------------------------------------------------

private:

	//-----------------------------------------------------
	// 内部実装
	//-----------------------------------------------------

};
