//====================================================//
// ファイル名   : Status.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/21
//
// 概要 : ステータスクラス
//
// 更新履歴 :
// 2026/07/21 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Common/Property/PropertyObject.h"

enum class Type
{
	Enemy,
	Player,
	Item,
	HelloWorld,
};

//====================================================//
// クラス宣言
//====================================================//
class Status : public REngine::PropertyObject
{
private:

    //-----------------------------------------------------
    // メンバ変数
    //-----------------------------------------------------

	// 名前
	std::string m_name;

	// 攻撃力
	int m_attack;

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
	Status()
		: m_name{ "Rull" }
		, m_attack{ 10 }
	{
		ADD_PROPERTY(m_name);
		ADD_PROPERTY(m_attack);
	}
    ~Status() = default;
};
