//====================================================//
// ファイル名   : ObjectFinder.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/07
//
// 概要 : オブジェクトの探索をするクラス
//
// 更新履歴 :
// 2026/07/07 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//

#include "GameObject/GameObject.h"

namespace REngine
{
	class Scene;

	//====================================================//
	// クラス宣言
	//====================================================//
	class ObjectFinder
	{
	private:

		//-----------------------------------------------------
		// 定数
		//-----------------------------------------------------


		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// シーンポインタ
		Scene* m_pScene;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		ObjectFinder(Scene* pScene)
			: m_pScene{ pScene }
		{}

		~ObjectFinder() = default;

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// ワールド空間にあるオブジェクトを名前検索する関数
		GameObject* FindWithNameInWorld(const std::string& name) const;

		// ワールド空間にあるオブジェクトをタグ検索する関数
		GameObject* FindWithTagInWorld(const std::string& tag) const;
	};
}	// namespace REngine
