//====================================================//
// ファイル名   : ObjectFactory.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/12
//
// 概要 : オブジェクトの生成を担うクラス
//
// 更新履歴 :
// 2026/07/12 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "GameObject/GameObject.h"

namespace REngine
{
	class Scene;

	//====================================================//
	// クラス宣言
	//====================================================//
	class ObjectFactory
	{
	private:
		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// シーンポインタ
		Scene* m_pScene;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		ObjectFactory(Scene* pScene);
		~ObjectFactory() = default;

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// オブジェクトを生成する関数
		GameObject* Generate(DirectX::SimpleMath::Vector3 position = { 0, 0, 0 });

		// UIオブジェクトを生成する関数
		GameObject* GenerateUI();
	};
}	// namespace REngine
