//====================================================//
// ファイル名   : UpdateMode.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/12
//
// 概要 : 更新モードの列挙型
//
// 更新履歴 :
// 2026/07/12 新規作成
//====================================================//

#pragma once

//====================================================//
// 列挙型宣言
//====================================================//

/// <summary>
/// 更新のモード
/// </summary>
enum class UpdateMode
{
	Play,	// 通常時
	Pause,	// ポーズ
	Edit,	// 編集中
};
