//====================================================//
// ファイル名   : Component.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/06
//
// 概要 : コンポーネントクラス
//
// 更新履歴 :
// 2026/05/06 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "BaseComponent.h"

//====================================================//
// クラス宣言
//====================================================//

template<typename T, ComponentID ID, bool Main = true>
class Component : public BaseComponent
{
public:
    //-----------------------------------------------------
    // 定数
    //-----------------------------------------------------

    static constexpr ComponentID TYPE_ID = ID;
    static constexpr bool IS_MAIN = Main;

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    Component(IComponentOwner* own)
        : BaseComponent(own, TYPE_ID, IS_MAIN)
    {
    };
    virtual ~Component() = default;
};