//====================================================//
// ファイル名   : FactoryRegister.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/06/29
//
// 概要 : エディター部分の初期化クラス
//
// 更新履歴 :
// 2026/06/29 新規作成
//====================================================//

#pragma once

namespace REngine
{
	//====================================================//
	// 宣言
	//====================================================//
	class FactoryRegister
	{
	public:

		// 生成関数を登録する関数
		static void RegistFactories();
	};
}	// namespace REngine
