//====================================================//
// ファイル名   : HandlePayload.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/27
//
// 概要 : ハンドルを受け渡しする用の構造体
//
// 更新履歴 :
// 2026/07/27 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include <typeindex>
#include "Assets/Objects/Handle.h"

namespace REngine
{
	//====================================================//
	// 構造体宣言
	//====================================================//
	struct HandlePayload
	{
		std::type_index type;	// 型
		UnTypeHandle handle;	// ハンドル
	};
}
