//====================================================//
// ファイル名   : PropertyOnInspector.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/17
//
// 概要 : プロパティをインスペクターに表示するクラス
//
// 更新履歴 :
// 2026/07/17 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Common/PropertyObject.h"

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class PropertyOnInspector
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// 編集中クォータニオンのキャッシュ
		DirectX::SimpleMath::Vector3 m_quaternionCache;
		// 編集中フラグ
		bool m_quaternionEditing;		

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		PropertyOnInspector() = default;
		~PropertyOnInspector() = default;

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------
		
		// プロパティを一つ表示する関数
		bool DrawProperty(const Property* property);

		// 終了時関数
		void End();
	};
}
