//====================================================//
// ファイル名  : KeyInput.cpp
// 作成者      : Hoshino Ryunosuke
// 作成日       : 2026/02/16
//
// 概要        :  キー入力管理クラス
//====================================================//

//====================================================//
// インクルードファイル
//====================================================//
#include "pch.h"
#include "Input/KeyInput.h"

namespace REngine
{
	//====================================================//
	// 関数の実体宣言
	//====================================================//

	namespace Input
	{
		// コンストラクタ
		Key::Key()
		{}

		// 更新関数
		void Key::Update()
		{
			// 前フレームの情報を保持
			m_oldState = m_nowState;

			// 最死因の情報を取得
			m_nowState = DirectX::Keyboard::Get().GetState();
		}
	}
}	// namespace REngine
