//====================================================//
// ファイル名   : EngineInitializer.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/06/26
//
// 概要 : ゲームエンジンの初期化を担当するクラス
//
// 更新履歴 :
// 2026/06/26 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//


//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class EngineInitializer
{
	//-----------------------------------------------------
	// メンバ変数
	//-----------------------------------------------------

	// 初期化済みフラグ
	static bool m_isInitialized;

public:

	//-----------------------------------------------------
	// コンストラクタ / デストラクタ
	//-----------------------------------------------------
	EngineInitializer() = default;
	~EngineInitializer() = default;

	//-----------------------------------------------------
	// 公開関数
	//-----------------------------------------------------

	// ゲームエンジン部分全体の初期化
	static void EngineInitialize();

private:
	
	// 3D衝突関数の登録
	static void Regist3DCollisions();

	// 2D衝突関数の登録
	static void Regist2DCollisions();

	// Ray衝突関数の登録
	static void RegistRayCollisions();

	// デバッグ描画関数の登録
	static void RegistDebugDrawers();

	// デフォルトのカスタムキーの登録
	static void RegistCustomKeys();

	// デフォルトのリソースの追加
	static void AddResources();
};