//====================================================//
// ファイル名   : GraphicsManager.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/18
//
// 概要 : 描画を管理するシングルトンクラス
//
// 更新履歴 :
// 2026/07/18 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "DeviceResources.h"

//====================================================//
// クラス宣言
//====================================================//
class GraphicsManager
{
private:

    //-----------------------------------------------------
    // メンバ変数
    //-----------------------------------------------------

	// デバイスリソース
	std::unique_ptr<DX::DeviceResources> m_deviceResources;

private:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
	GraphicsManager()
		: m_deviceResources{ std::make_unique<DX::DeviceResources>() }
	{
	};
    ~GraphicsManager() = default;

public:
    //-----------------------------------------------------
    // 公開関数
    //-----------------------------------------------------

	// インスタンス
	static GraphicsManager& Instance()
	{
		static GraphicsManager instance;
		return instance;
	}

    //-----------------------------------------------------
    // ゲッター
    //-----------------------------------------------------

	// デバイスリソース
	DX::DeviceResources* GetDeviceResources() { return m_deviceResources.get(); }
};
