//====================================================//
// ファイル名   : PerformanceStats.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/10/23
//
// 概要 : パフォーマンスに関する数値を持つシングルトンクラス
//
// 更新履歴 :
// 2026/10/23 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//

namespace RHEngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class PerformanceStats
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		//-------- パフォーマンス値 --------//

		// FPS
		float m_fps;

		// 


		//-------- 計測補助変数 --------//
	private:

		uint32_t m_frameCount;		// 経過したフレーム数
		float m_timeAccumulator;	// 経過した時間

	private:
		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		PerformanceStats() = default;
		~PerformanceStats() = default;

	public:
		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// インスタンス取得
		static PerformanceStats& Instance()
		{
			static PerformanceStats instance;
			return instance;
		}

		// 更新関数
		void Update(float elapsedTime);

		//-----------------------------------------------------
		// ゲッター
		//-----------------------------------------------------

		float GetFPS() const { return m_fps; }

		//-----------------------------------------------------
		// 内部実装
		//-----------------------------------------------------
	private:

		// FPSの計測
		void MeasureFPS(float elapsedTime);
	};
}
