//====================================================//
// ファイル名   : WindowManager.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/06/10
//
// 概要 : ウィンドウの状態を管理するクラスです
//
// 更新履歴 :
// 2026/06/10 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//

//====================================================//
// 前方宣言
//====================================================//

class Game;

//====================================================//
// マクロ宣言
//====================================================//

// ウインドウスタイル
#define WS_MYSTYLE ( WS_OVERLAPPED     | \
                     WS_CAPTION        | \
                     WS_SYSMENU        | \
                     WS_MINIMIZEBOX )

//====================================================//
// クラス宣言
//====================================================//
class WindowManager
{
private:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    WindowManager() = default;
    ~WindowManager() = default;

    //-----------------------------------------------------
    // 公開関数
    //-----------------------------------------------------
public:

    // シングルトン化
    static WindowManager& Instance()
    {
        static WindowManager instance;
        return instance;
    }

    // フルスクリーンとウィンドウを切り替える関数
    void SwitchScreenMode(HWND hWnd, Game* game);
};
