//====================================================//
// ファイル名   : CameraManager.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/04/17
//
// 概要 : カメラ管理クラス
//
// 更新履歴 :
// 2026/04/17 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "ReserveContainer.h"
#include "Components/World/Camera/CameraBase.h"

namespace REngine
{
	//====================================================//
	// 前方宣言
	//====================================================//
	class Scene;

	//====================================================//
	// クラス宣言
	//====================================================//
	class CameraManager : public ReserveContainer<CameraBase>
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// 使用しているメインカメラ
		CameraBase* m_mainCamera;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
	public:
		CameraManager();
		~CameraManager();

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// メインカメラを取得する関数
		CameraBase* GetMainCamera() const
		{			
			auto& cameras = GetObjects();

			// 追加逆順に調べる
			for (auto it = cameras.rbegin(); it != cameras.rend(); ++it)
			{
				// レンダーターゲットが設定されていなければ
				if (!(*it)->GetRenderTarget())
				{
					// メインカメラとして返す
					return (*it);
				}
			}

			return nullptr;
		}
	};
}	// namespace REngine
