//====================================================//
// ファイル名  : CameraManager.cpp
// 作成者      : Hoshino Ryunosuke
// 作成日       : 2026/04/17
//
// 概要        :  カメラ管理クラス
//====================================================//

//====================================================//
// インクルードファイル
//====================================================//
#include "pch.h"
#include "CameraManager.h"

namespace REngine
{
	//====================================================//
	// 関数の実体宣言
	//====================================================//

	CameraManager::CameraManager()
		: m_mainCamera{ nullptr }
	{

	}

	CameraManager::~CameraManager()
	{}
}	// namespace REngine
