//====================================================//
// ファイル名   : ObjectManager.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/04/07
//
// 概要 : オブジェクト管理クラス
//
// 更新履歴 :
// 2026/04/07 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "GameObject/GameObject.h"
#include <vector>

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class ObjectManager
{
private:

	//-----------------------------------------------------
	// 定数
	//-----------------------------------------------------


	//-----------------------------------------------------
	// メンバ変数
	//-----------------------------------------------------

	// 生成予約中のオブジェクトリスト
	std::vector<GameObject*> m_reservations;

	// 管理しているオブジェクトリスト
	std::vector<std::unique_ptr<GameObject>> m_objects;

public:

	//-----------------------------------------------------
	// コンストラクタ / デストラクタ
	//-----------------------------------------------------
public:
	ObjectManager();
	~ObjectManager();

	//-----------------------------------------------------
	// 公開関数
	//-----------------------------------------------------
	
	// 更新関数
	void Update(const GameTimer& gameTimer);
	void LateUpdate(const GameTimer& gameTimer);

	void RemoveDeadComponent();

	// 終了関数
	void Finalize();

	// キャッシュを適用する関数
	void AllReflectCache();

	// オブジェクト追加関数
	void AddObject(GameObject* object)
	{
		// 予約リストに追加
		m_reservations.push_back(object);
	}

	// オブジェクト削除関数
	void Destroy(GameObject* object)
	{
		// 削除フラグを立てる
		object->Destroy();
	}

	void AllDestroy();

	// 死亡オブジェクトを削除する関数
	void RemoveDeadObject();

private:

	//-----------------------------------------------------
	// 内部実装
	//-----------------------------------------------------

	// 予約されているオブジェクトを全てリストへ追加する関数
	void AddReservedObject();
};
