//====================================================//
// ファイル名   : ButtonListenerBase.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/27
//
// 概要 : ボタンが押されたときに通知されるコンポーネント
//
// 更新履歴 :
// 2026/05/27 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Components/UI/UIComponentBase.h"
#include "GameObject/Interface/IComponentOwner.h"

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class ButtonListenerBase : public UIComponentBase
	{
	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		ButtonListenerBase(IComponentOwner* own)
			: UIComponentBase(own)
		{}
		~ButtonListenerBase() = default;

		//-----------------------------------------------------
		// Type
		//-----------------------------------------------------

		COMPONENT_TYPE(ButtonListenerBase, UIComponentBase)

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// クリック時に呼ばれる関数
		virtual void OnClicked() = 0;
	};
} // namespace REngine
