//====================================================//
// ファイル名   : UIBehaviorBase.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/27
//
// 概要 : 動きを持たせるUIの基盤
//
// 更新履歴 :
// 2026/05/27 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Components/UI/UIComponentBase.h"
#include "GameObject/Interface/IComponentOwner.h"

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class UIBehaviorBase : public UIComponentBase
	{
	private:
		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		bool m_isHovered;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		UIBehaviorBase(IComponentOwner* own)
			: UIComponentBase(own)
			, m_isHovered{ false }
		{}
		~UIBehaviorBase() = default;

		//-----------------------------------------------------
		// Type
		//-----------------------------------------------------

		COMPONENT_TYPE(UIBehaviorBase, UIComponentBase)

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// マウスクリック開始時
		virtual void OnMouseDown() {};

		// マウスクリック終了時
		virtual void OnMouseUp() {};

		// ホバーセット
		void SetHovered(bool hovered) { m_isHovered = hovered; };

		//-----------------------------------------------------
		// ゲッター
		//-----------------------------------------------------

		bool IsHovered() const { return m_isHovered; }
	};
} // namespace REngine
