//====================================================//
// ファイル名   : GameMath.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/03/19
//
// 概要 : 数学関連の関数をまとめたヘッダー
//
// 更新履歴 :
// 2026/03/19 新規作成
// 2026/03/19 Clamp関数の追加
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Range.h"

//====================================================//
// 関数宣言
//====================================================//
namespace MyMath
{
	// 符号取得関数
	template<typename T, typename = std::enable_if_t<std::is_arithmetic_v<T>>>
	static int Sign(T value)
	{
		if (value > 0) return 1;
		if (value < 0) return -1;
		return 0;
	}
}
