//====================================================//
// ファイル名   : AssetFileDrawer.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/10/08
//
// 概要 : アセットファイルのGUI表示を行うクラス
//
// 更新履歴 :
// 2026/10/08 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//

#include <filesystem>

namespace REngine
{
	class AssetManager;

	//====================================================//
	// クラス宣言
	//====================================================//
	class AssetFileDrawer
	{
	public:

		// 表示の結果用構造体
		enum class Result
		{
			None, Select, DoubleClick
		};

	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// アセットマネージャー
		AssetManager& m_assetManager;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		AssetFileDrawer(AssetManager& am)
			: m_assetManager{ am }
		{}
		~AssetFileDrawer() = default;

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// 表示関数
		Result DrawAssetFile(const std::filesystem::path& path, bool selected);

	private:

		//-----------------------------------------------------
		// 内部実装
		//-----------------------------------------------------

	};
}
