//====================================================//
// ファイル名   : UIGraphic.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/23
//
// 概要 : UIのグラフィックコンポーネントの基底クラス
//
// 更新履歴 :
// 2026/05/23 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "BaseGraphic.h"

//====================================================//
// クラス宣言
//====================================================//
template<typename T, UIComponentID ID, bool Main = false>
class UIGraphic : public BaseGraphic
{
public:

    //-----------------------------------------------------
    // 定数
    //-----------------------------------------------------
    static constexpr UIComponentID TYPE_ID = ID;
    static constexpr bool IS_MAIN = Main;

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    UIGraphic(UIObject* own)
        : BaseGraphic(own, TYPE_ID, IS_MAIN)
    {
    };
    virtual ~UIGraphic() = default;
};