//====================================================//
// ファイル名   : Collider2D.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/06
//
// 概要 : 2次元コライダー
//
// 更新履歴 :
// 2026/05/06 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "BaseCollider2D.h"

//====================================================//
// クラス宣言
//====================================================//

template<typename T, ComponentID ID, bool Main = false>
class Collider2D : public BaseCollider2D
{
public:
    //-----------------------------------------------------
    // 定数
    //-----------------------------------------------------

    static constexpr ComponentID TYPE_ID = ID;
    static constexpr bool IS_MAIN = Main;

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    Collider2D(IComponentOwner* own, ColliderType2D type)
        : BaseCollider2D(own, type, TYPE_ID, IS_MAIN)
    {
    };
    virtual ~Collider2D() = default;
};