//====================================================//
// ファイル名   : RendererManager.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/03
//
// 概要 : 描画コンポーネントを管理するクラス
//
// 更新履歴 :
// 2026/05/03 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//

#include "../ReserveContainer.h"
#include "Components/World/Renderer/RendererBase.h"

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class RendererManager : public ReserveContainer<RendererBase>
	{
	private:

	   //-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		RendererManager();
		~RendererManager();

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// 描画処理
		void DrawAll(Renderer& renderer);
	};
}	// namespace REngine
