//====================================================//
// ファイル名   : MaterialSaver.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/10/10
//
// 概要 : マテリアルを保存するクラス
//
// 更新履歴 :
// 2026/10/10 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//

#include "Assets/Types/Material/MaterialAsset.h"
#include "Assets/Objects/AssetBase.h"

namespace REngine
{
	class AssetContext;

	namespace Saver
	{
		//====================================================//
		// クラス宣言
		//====================================================//
		class MaterialSaver
		{
		public:

			//-----------------------------------------------------
			// コンストラクタ / デストラクタ
			//-----------------------------------------------------
			MaterialSaver() = default;
			~MaterialSaver() = default;

			//-----------------------------------------------------
			// 公開関数
			//-----------------------------------------------------

			static void Save(AssetBase* asset, const std::filesystem::path& path, AssetContext& ctx);
		};
	}
}
