//====================================================//
// ファイル名   : BaseRenderer.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/04/28
//
// 概要 : レンダラーコンポーネントの基底クラスです
//
// 更新履歴 :
// 2026/04/28 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "../BaseComponent.h"
#include "../Transform/Transform.h"

//====================================================//
// 前方宣言
//====================================================//
class Renderer;

//====================================================//
// クラス宣言
//====================================================//
class BaseRenderer : public BaseComponent
{
    // ----------------------------------------------------
    // 定数宣言
    // ----------------------------------------------------
public:
    static constexpr ComponentID TYPE_ID = ComponentID::Renderer;
    static constexpr bool IS_MAIN = true;

    //-----------------------------------------------------
    // メンバ変数
    //-----------------------------------------------------
    
    // トランスフォームポインタ
    Transform* m_pTransform;

    // 透明度
    float m_alpha;

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    BaseRenderer(IComponentOwner* own, ComponentID ID, bool isMain);
    ~BaseRenderer() = default;

    //-----------------------------------------------------
    // 公開関数
    //-----------------------------------------------------

    // 描画関数
    virtual void Draw(Renderer& renderer) = 0;

    // セッター
    void SetAlpha(float alpha)
    {
        m_alpha = std::clamp(alpha, 0.0f, 1.0f); 
    }

    //-----------------------------------------------------
    // ゲッター
    //-----------------------------------------------------
protected:
    Transform* GetTransform() const { return m_pTransform; }

    float GetAlpha() const { return m_alpha; }
};