//====================================================//
// ファイル名   : RendererComponent.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/06
//
// 概要 : 描画コンポーネント
//
// 更新履歴 :
// 2026/05/06 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "BaseRenderer.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
template<typename T, ComponentID ID, bool Main = false>
class RendererComponent : public BaseRenderer
{
public:
    //-----------------------------------------------------
    // 定数
    //-----------------------------------------------------

    static constexpr ComponentID TYPE_ID = ID;
    static constexpr bool IS_MAIN = Main;

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    RendererComponent(IComponentOwner* own)
        : BaseRenderer(own, TYPE_ID, IS_MAIN)
    {
    };
    virtual ~RendererComponent() = default;
};