//====================================================//
// ファイル名   : AssetAux.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/26
//
// 概要 : アセットの補助構造体
//
// 更新履歴 :
// 2026/07/26 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include <string>
#include "UUID.h"

namespace REngine
{
	//====================================================//
	// 構造体宣言
	//====================================================//

	struct AssetAux
	{
		// UUID
		UUID uuid;

		// アセットの種類
		std::string assetType;
	};
}	// namespace REngine
