//====================================================//
// ファイル名   : LoadStatus.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/26
//
// 概要 : 読み込み状態を宣言したヘッダ
//
// 更新履歴 :
// 2026/07/26 新規作成
//====================================================//

#pragma once

namespace REngine
{
	//====================================================//
	// 列挙型宣言
	//====================================================//
	enum class LoadStatus
	{
		Unloaded, // 開始前
		Loading,  // 読み込み中
		Loaded,   // 成功
		Failed    // 失敗
	};
}	// namespace REngine
