//====================================================//
// ファイル名   : ImageUI.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/23
//
// 概要 : 画像描画コンポーネント
//
// 更新履歴 :
// 2026/05/23 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Components/UI/Graphics/UIGraphicBase.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class ImageUI : public UIGraphicBase
{
private:

	//-----------------------------------------------------
	// メンバ変数
	//-----------------------------------------------------

	// テクスチャ
	ID3D11ShaderResourceView* m_pTexture;

	// Rayと衝突するかどうか
	bool m_raycastTarget;

public:

	//-----------------------------------------------------
	// コンストラクタ / デストラクタ
	//-----------------------------------------------------
	ImageUI(IComponentOwner* owner)
		: UIGraphicBase(owner)
		, m_pTexture{ nullptr }
		, m_raycastTarget{ true }
	{
	}
	
	~ImageUI() = default;

	//-----------------------------------------------------
	// 公開関数
	//-----------------------------------------------------

	void Draw(Renderer& renderer) override;

	//-----------------------------------------------------
	// ゲッター
	//-----------------------------------------------------

	// ID取得
	unsigned int GetID() override
	{
		return TypeIDGenerator::GetID<ImageUI>();
	}

	bool IsRaycastTarget() const { return m_raycastTarget; }

	//-----------------------------------------------------
	// セッター
	//-----------------------------------------------------

	void SetTexture(ID3D11ShaderResourceView* texture) { m_pTexture = texture; }
	void SetRaycastTarget(bool f) { m_raycastTarget = f; }

private:

	//-----------------------------------------------------
	// 内部実装
	//-----------------------------------------------------

};