//====================================================//
// ファイル名   : WorldComponentBase.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/06/28
//
// 概要 : World空間のコンポーネントの基底クラス
//
// 更新履歴 :
// 2026/06/28 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Components/ComponentBase.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class WorldComponentBase : public ComponentBase
{
public:

	//-----------------------------------------------------
	// コンストラクタ / デストラクタ
	//-----------------------------------------------------
	WorldComponentBase(IComponentOwner* owner)
		: ComponentBase(owner)
	{}

	virtual ~WorldComponentBase() = default;

	//-----------------------------------------------------
	// 公開関数
	//-----------------------------------------------------

	// 所属空間をWorldに設定
	ComponentSpace GetSpace() const override
	{
		return ComponentSpace::World;
	}

	// カテゴリをOriginalに指定
	ComponentCategory GetCategory() const override
	{
		return ComponentCategory::Original;
	}
};
