//====================================================//
// ファイル名   : PrefabImpl.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/28
//
// 概要 : 
//
// 更新履歴 :
// 2026/07/28 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include <fstream>
#include "nlohmann/json.hpp"

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class PrefabImpl
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// json本体
		nlohmann::json m_json;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		PrefabImpl(const std::filesystem::path& path)
		{
			std::ifstream ifs(path);

			// 開けていたら
			if (ifs.is_open())
			{
				// jsonへ
				ifs >> m_json;
			}

			// 閉じる
			ifs.close();
		}
		~PrefabImpl() = default;

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// jsonのゲッター
		const nlohmann::json& GetJson() const { return m_json; }
	};
}	// namespace REngine
