//====================================================//
// ファイル名  : Prefab.cpp
// 作成者      : Hoshino Ryunosuke
// 作成日       : 2026/07/28
//
// 概要       : 
//====================================================//

//====================================================//
// インクルードファイル
//====================================================//
#include "pch.h"
#include "Assets/Types/Prefab.h"

#include "Assets/Types/PrefabImpl.h"

//====================================================//
// 関数の実体宣言
//====================================================//

REngine::Prefab::Prefab(std::filesystem::path path)
	: m_impl{ std::make_unique<PrefabImpl>(path) }
{
}
