//====================================================//
// ファイル名   : ButtonUI.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/27
//
// 概要 : ボタンUIクラス
//
// 更新履歴 :
// 2026/05/27 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "../../UIComponent.h"
#include <functional>

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class ButtonUI : public UIComponent<ButtonUI, UIComponentID::Button>
{
private:

    //-----------------------------------------------------
    // 定数
    //-----------------------------------------------------


    //-----------------------------------------------------
    // メンバ変数
    //-----------------------------------------------------

    // 各状態の色

    int m_normalColor;  // 通常時
    int m_hoverdColor;  // ホバー時
    int m_pressedColor; // 押されている時

    // クリック時に実行される処理
    std::function<void()> m_onClick;

    bool m_isHovered;   // マウスが自分の上にあるか
    bool m_isPressed;   // 自分が押されているか

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    ButtonUI(UIObject* own);
    ~ButtonUI();

    //-----------------------------------------------------
    // 公開関数
    //-----------------------------------------------------
    void Update(const GameTimer& gameTimer) override;

    //-----------------------------------------------------
    // ゲッター
    //-----------------------------------------------------


    //-----------------------------------------------------
    // セッター
    //-----------------------------------------------------

    void SetNormalColor(int color) { m_normalColor = color; }
    void SetHoveredColor(int color) { m_hoverdColor = color; }
    void SetPressedColor(int color) { m_pressedColor = color; }

    void SetIsHovered(bool f) { m_isHovered = f; }

    void SetOnClick(std::function<void()> func) { m_onClick = func; }

private:

    //-----------------------------------------------------
    // 内部実装
    //-----------------------------------------------------

};