//====================================================//
// ファイル名   : StartCamera.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/27
//
// 概要 : ゲーム開始時の演出を担当するカメラ
//
// 更新履歴 :
// 2026/05/27 新規作成
//====================================================//

#pragma once

#define IS_COMPONENT(StartCamera)

//====================================================//
// インクルードファイル
//====================================================//
#include "Components/World/WorldComponentBase.h"
#include "GameObject/Interface/IComponentOwner.h"

#include "Components/World/Transform/Transform.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class StartCamera : public WorldComponentBase
{
private:

	//-----------------------------------------------------
	// 定数
	//-----------------------------------------------------


	//-----------------------------------------------------
	// メンバ変数
	//-----------------------------------------------------

	// トランスフォームポインタ
	Transform* m_pTransform;

	// ターゲット名
	std::string m_targetName;

	// ターゲット
	DirectX::SimpleMath::Vector3 m_target;

	// 回る半径
	float m_radius;

	// 終了時の角度
	float m_finalAngle;

	// 回る各速度
	float m_angleVelocity;

	// 初期状態の高さ
	float m_initialHeight;

	// 落ちる速さ
	float m_fallVelocity;

	// 現在の角度
	float m_nowAngle;

	// オフセット
	DirectX::SimpleMath::Vector3 m_offset;

public:

	//-----------------------------------------------------
	// コンストラクタ / デストラクタ
	//-----------------------------------------------------
	StartCamera(IComponentOwner* own);
	~StartCamera() = default;

	//-----------------------------------------------------
	// 公開関数
	//-----------------------------------------------------

	void Awake() override;
	void Start() override;

	void Update(const GameTimer& gameTimer) override;

	//-----------------------------------------------------
	// ゲッター
	//-----------------------------------------------------

	// ID取得
	unsigned int GetID() override
	{
		return TypeIDGenerator::GetID<StartCamera>();
	}

	//-----------------------------------------------------
	// セッター
	//-----------------------------------------------------

private:

	//-----------------------------------------------------
	// 内部実装
	//-----------------------------------------------------

};
