//====================================================//
// ファイル名   : Mesh.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/10/06
//
// 概要 : メッシュアセット
//
// 更新履歴 :
// 2026/10/06 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//

#include <wrl/client.h>
#include <d3d11.h>

#include "Assets/Objects/AssetBase.h"
#include "SubMesh.h"

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class Mesh : public AssetBase
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// 頂点バッファ
		Microsoft::WRL::ComPtr<ID3D11Buffer> m_vertexBuffer;

		// インデックスバッファ
		Microsoft::WRL::ComPtr<ID3D11Buffer> m_vertexBuffer;

		// サブメッシュ配列
		std::vector<SubMesh> m_subMeshes;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		Mesh();
		~Mesh() = default;

		//-----------------------------------------------------
		// ゲッター
		//-----------------------------------------------------

	};
}
