//====================================================//
// ファイル名   : Model.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/10/07
//
// 概要 : モデルアセット
//
// 更新履歴 :
// 2026/10/07 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include <vector>

#include "Assets/Objects/Handle.h"
#include "Mesh.h"
#include "Assets/Types/MaterialAsset.h"

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class Model : public AssetBase
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// 自分が持つメッシュ
		std::vector<Handle<Mesh>> m_meshes;
		
		// 自分が持つマテリアル
		std::vector<Handle<MaterialAsset>> m_materials;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		Model() = default;
		~Model() = default;

	};
}
