//====================================================//
// ファイル名   : SubMesh.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/10/07
//
// 概要 : 
//
// 更新履歴 :
// 2026/10/07 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Windows.h"
#include "Math/Bounding.h"

namespace REngine
{
	//====================================================//
	// 構造体宣言
	//====================================================//
	struct SubMesh
	{
		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		UINT indexCount;	// 描画するインデックスの数

		UINT indexOffset;	// 何番目のインデックスから描画を始めるか

		INT vertexOffset;	// 頂点バッファの頂点を読み取る際に、全てのインデックスに対して加算される値

		BoundingBox boudingBox;	// SubMeshを覆う境界ボックス
	};
}
