//====================================================//
// ファイル名   : SelectedOnGUI.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/29
//
// 概要 : GUI上で選択されているオブジェクトを持つクラス
//
// 更新履歴 :
// 2026/07/29 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Common/Property/PropertyObject.h"

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class SelectedOnGUI
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// 選択中のオブジェクト
		PropertyObject* m_propertyObject;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		SelectedOnGUI()
			: m_propertyObject{ nullptr } 
		{};
		~SelectedOnGUI() = default;

		//-----------------------------------------------------
		// ゲッター
		//-----------------------------------------------------

		PropertyObject* GetSelected() const 
		{
			return m_propertyObject; 
		}

		//-----------------------------------------------------
		// セッター
		//-----------------------------------------------------

		void SetSelected(PropertyObject* obj) 
		{
			m_propertyObject = obj; 
		}
	};
}
