//====================================================//
// ファイル名   : SelectBlock.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/27
//
// 概要 : 選択
//
// 更新履歴 :
// 2026/05/27 新規作成
//====================================================//

#pragma once

#define IS_COMPONENT(SelectBlock)

//====================================================//
// インクルードファイル
//====================================================//
#include "Components/World/WorldComponentBase.h"
#include "GameObject/Interface/IComponentOwner.h"
#include "GameObject/GameObject.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class SelectBlock : public WorldComponentBase
{
private:

	//-----------------------------------------------------
	// 定数
	//-----------------------------------------------------


	//-----------------------------------------------------
	// メンバ変数
	//-----------------------------------------------------

	// ターゲットシーン名
	std::string m_targetScene;

	// 対応するUIの名前
	std::string m_uiName;

	// UIオブジェクト
	GameObject* m_uiObject;

public:

	//-----------------------------------------------------
	// コンストラクタ / デストラクタ
	//-----------------------------------------------------
	SelectBlock(IComponentOwner* own);
	~SelectBlock() = default;

	//-----------------------------------------------------
	// 公開関数
	//-----------------------------------------------------

	void Start() override;

	void OnTriggerStay(HitContact& contact) override;
	void OnTriggerEnter(HitContact& contact) override;
	void OnTriggerExit(HitContact& contact) override;

	//-----------------------------------------------------
	// ゲッター
	//-----------------------------------------------------

	// ID取得
	unsigned int GetID() override
	{
		return TypeIDGenerator::GetID<SelectBlock>();
	}

private:

	//-----------------------------------------------------
	// 内部実装
	//-----------------------------------------------------

};
