//====================================================//
// ファイル名   : GameController.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/09/01
//
// 概要 : ゲーム全体を操作するクラス
//
// 更新履歴 :
// 2026/09/01 新規作成
//====================================================//

#pragma once

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class GameController
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

	private:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		GameController() = default;
		~GameController() = default;

	public:

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// インスタンス取得
		static GameController& Instance()
		{
			static GameController instance;
			return instance;
		}

		// ゲーム終了関数
		void Quit();
	};
}
