//====================================================//
// ファイル名   : ComponentRegister.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/06/26
//
// 概要 : コンポーネントを各マネージャーへ登録するクラス
//
// 更新履歴 :
// 2026/06/26 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Components/ComponentBase.h"

//====================================================//
// 前方宣言
//====================================================//
class UpdatePipeline;
class ComponentBasel;

//====================================================//
// クラス宣言
//====================================================//
class ComponentRegister
{
private:

	//-----------------------------------------------------
	// メンバ変数
	//-----------------------------------------------------

	UpdatePipeline* m_pPipeline;

public:

	//-----------------------------------------------------
	// コンストラクタ / デストラクタ
	//-----------------------------------------------------
	ComponentRegister(UpdatePipeline* pipeline);
	~ComponentRegister() = default;

	//-----------------------------------------------------
	// 公開関数
	//-----------------------------------------------------

	// 各マネージャーへ登録する関数
	void RegisterComponent(ComponentBase* component);

	// 各マネージャーから登録解除する関数
	void UnRegisterComponent(ComponentBase* component);
};
