//====================================================//
// ファイル名   : GameTimer.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/06/04
//
// 概要 : 各オブジェクトに渡すゲーム用のタイマークラス
//
// 更新履歴 :
// 2026/06/04 新規作成
//====================================================//

#pragma once

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class GameTimer
	{
		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// スケールされた経過時間
		float m_elapsedTime;

		// 本当の経過時間
		float m_unscaledElapsedTime;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		GameTimer()
			: m_elapsedTime{ 0.0f }
			, m_unscaledElapsedTime{ 0.0f }
		{}
		~GameTimer() = default;

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		void Update(float elapsedTime);

		//-----------------------------------------------------
		// ゲッター
		//-----------------------------------------------------
		float GetElapsedTime() const { return m_elapsedTime; }
		float GetUnScaledElapsedTime() const { return m_unscaledElapsedTime; }
	};
}	// namespace REngine
