//====================================================//
// ファイル名   : RendererBase.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/04/28
//
// 概要 : レンダラーコンポーネントの基底クラスです
//
// 更新履歴 :
// 2026/04/28 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Components/World/WorldComponentBase.h"
#include "Components/World/Transform/Transform.h"

namespace REngine
{
	//====================================================//
	// 前方宣言
	//====================================================//
	class Renderer;

	//====================================================//
	// クラス宣言
	//====================================================//
	class RendererBase : public WorldComponentBase
	{
		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// トランスフォームポインタ
		Transform* m_pTransform;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		RendererBase(IComponentOwner* own);
		~RendererBase() = default;

		//-----------------------------------------------------
		// Type
		//-----------------------------------------------------

		COMPONENT_TYPE(RendererBase, WorldComponentBase)

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// 描画関数
		virtual void Draw(Renderer& renderer) = 0;

		//-----------------------------------------------------
		// ゲッター
		//-----------------------------------------------------
	protected:
		Transform* GetTransform() const { return m_pTransform; }

	};
} // namespace REngine
