//====================================================//
// ファイル名   : TitleToPlayEvent.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/27
//
// 概要 : タイトルからゲームシーンへの移行を実装するイベントコンポーネント
//
// 更新履歴 :
// 2026/05/27 新規作成
//====================================================//

#pragma once

#define IS_COMPONENT(TitleToPlayEvent)

//====================================================//
// インクルードファイル
//====================================================//
#include "Components/UI/Behaviour/ButtonListenerBase.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class TitleToPlayEvent : public REngine::ButtonListenerBase
{
public:

	//-----------------------------------------------------
	// コンストラクタ / デストラクタ
	//-----------------------------------------------------
	TitleToPlayEvent(REngine::IComponentOwner* own);
	~TitleToPlayEvent() = default;

	//-----------------------------------------------------
	// 公開関数
	//-----------------------------------------------------

	void OnClicked() override;

	//-----------------------------------------------------
	// ゲッター
	//-----------------------------------------------------

	// ID取得
	unsigned int GetID() override
	{
		return REngine::TypeIDGenerator::GetID<TitleToPlayEvent>();
	}
};
