//====================================================//
// ファイル名   : Camera.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/20
//
// 概要 : カメラ
//
// 更新履歴 :
// 2026/05/20 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "BaseCamera.h"

//====================================================//
// クラス宣言
//====================================================//

template<typename T, ComponentID ID, bool Main = false>
class Camera : public BaseCamera
{
public:
    //-----------------------------------------------------
    // 定数
    //-----------------------------------------------------

    static constexpr ComponentID TYPE_ID = ID;
    static constexpr bool IS_MAIN = Main;

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    Camera(IComponentOwner* own)
        : BaseCamera(own, TYPE_ID, IS_MAIN)
    {
    };
    virtual ~Camera() = default;
};