//====================================================//
// ファイル名  : BaseComponent.cpp
// 作成者      : Hoshino Ryunosuke
// 作成日       : 2026/04/02
//
// 概要       : コンポーネントの基底クラス  
//====================================================//

//====================================================//
// インクルードファイル
//====================================================//
#include "pch.h"
#include "BaseUIComponent.h"

//====================================================//
// 関数の実体宣言
//====================================================//

BaseUIComponent::BaseUIComponent(UIObject* own, UIComponentID id, bool isMain)
	: m_own{ own }
	, m_myID{ id }
	, m_isMain{ isMain }
{
}
