//====================================================//
// ファイル名   : BaseUIComponent.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/11
//
// 概要 : UI用コンポーネント基底クラス
//
// 更新履歴 :
// 2026/05/11 新規作成
//====================================================//

#pragma once

#include "UIComponentID.h"

//====================================================//
// 前方宣言
//====================================================//
class UIObject;
class Renderer;

//====================================================//
// クラス宣言
//====================================================//
class BaseUIComponent
{
private:

    //-----------------------------------------------------
    // 定数
    //-----------------------------------------------------


    //-----------------------------------------------------
    // メンバ変数
    //-----------------------------------------------------

    // 所有者のポインタ
    UIObject* m_own;

    // アクティブフラグ
    bool m_isActive;

    // 自身のID
    const UIComponentID m_myID;
    const bool m_isMain;

    // Start関数が呼ばれたか
    bool m_isStarted;

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    BaseUIComponent(UIObject* own, UIComponentID id, bool isMain);
    ~BaseUIComponent() {};

    //-----------------------------------------------------
    // 公開関数
    //-----------------------------------------------------

    virtual void Awake() {}
    virtual void Start() {}

    virtual void Update([[maybe_unused]] float elapsedTime) {}

    virtual void OnDestroy() {}

    //-----------------------------------------------------
    // ゲッター
    //-----------------------------------------------------
    UIObject* GetOwn() const { return m_own; }

    bool IsActive() const { return m_isActive; }

    UIComponentID GetID() const { return m_myID; }
    bool IsMain() const { return m_isMain; }

	bool IsStarted() const { return m_isStarted; }

    //-----------------------------------------------------
    // セッター
    //-----------------------------------------------------

    void SetActive(bool f) { m_isActive = f; }

    void SetStart() { m_isStarted = true; }

private:

    //-----------------------------------------------------
    // 内部実装
    //-----------------------------------------------------

};