//====================================================//
// ファイル名   : ComponentFactory.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/06/11
//
// 概要 : コンポーネントのファクトリクラス
//
// 更新履歴 :
// 2026/06/11 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "../Components/Components.h"
#include "../Components/ComponentID.h"

#include "../GameObject.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class ComponentFactory final
{
public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    ComponentFactory() = default;
    ~ComponentFactory() = default;

    //-----------------------------------------------------
    // 公開関数
    //-----------------------------------------------------

    // ID指定で作成する
    static BaseComponent* CreateComponent(GameObject* owner, ComponentID id);

};