//====================================================//
// ファイル名   : GameObjectSaver.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/06/11
//
// 概要 : ゲームオブジェクトを外部ファイルに保存するクラス
//
// 更新履歴 :
// 2026/06/11 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "../GameObject.h"

//====================================================//
// クラス宣言
//====================================================//
class GameObjectSaver
{
public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    GameObjectSaver() = default;
    ~GameObjectSaver() = default;

    //-----------------------------------------------------
    // 公開関数
    //-----------------------------------------------------

    // セーブする関数
    static void SaveObject(GameObject* obj, const std::string& fileName);

    static void LoadObject(GameObject* obj, const std::string& fileName);

};