//====================================================//
// ファイル名   : SceneEditor.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/05
//
// 概要 : シーンエディタ
//
// 更新履歴 : 
// 2026/07/05 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Scene/Scene.h"
#include "Editor/Editor/EditGUI.h"
#include "Editor/Editor/SceneCamera.h"

namespace REngine
{
	class AssetManager;

	//====================================================//
	// クラス宣言
	//====================================================//
	class SceneEditor
	{
	private:
		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// シーンポインタ
		Scene* m_pScene;

		// アクティブフラグ
		bool m_isActive;

		// 再生中フラグ
		bool m_isPlaying;

		// GUI
		EditGUI m_gui;

		// シーンビュー
		std::unique_ptr<RenderTarget> m_sceneView;

		// シーンビューカメラ
		SceneCamera* m_sceneViewCamera;

		// アセットマネージャー
		AssetManager& m_assetManager;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		SceneEditor(Scene* pScene, AssetManager& am);
		~SceneEditor();

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		void Initialize();
		void Update(const GameTimer& gameTimer);
		void Render(Renderer& renderer);

		//-----------------------------------------------------
		// ゲッター
		//-----------------------------------------------------

		//-----------------------------------------------------
		// セッター
		//-----------------------------------------------------

	private:

		//-----------------------------------------------------
		// 内部実装
		//-----------------------------------------------------

		void TestPlay();
	};
} // namespace REngine
