//====================================================//
// ファイル名   : AssetLoadContext.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/10/08
//
// 概要 : アセットロード時に参照される仲介クラス
//
// 更新履歴 :
// 2026/10/08 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "AssetDataBase.h"
#include "AssetRegistry.h"

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class AssetLoadContext
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		AssetDataBase& m_dataBase;

		AssetRegistry& m_registry;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		AssetLoadContext(AssetDataBase& db, AssetRegistry& r)
			: m_dataBase{ db }
			, m_registry{ r }
		{
		}
		~AssetLoadContext() = default;

		//-----------------------------------------------------
		// ゲッター
		//-----------------------------------------------------

		AssetDataBase& GetDataBase() const { return m_dataBase; }
		AssetRegistry& GetRegistry() const { return m_registry; }
	};
}
