//====================================================//
// ファイル名   : AuxFileRepository.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/26
//
// 概要 : AssetAuxと.auxファイルの読み書きを行うクラス
//
// 更新履歴 :
// 2026/07/26 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Assets/Objects/AssetAux.h"

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class AuxFileRepository
	{
	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		AuxFileRepository() = default;
		~AuxFileRepository() = default;

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		void SaveAux(AssetAux& aux, const std::wstring& path);

		void LoadAux(AssetAux& aux, const std::wstring& path);
	};
}	// namespace REngine
