//====================================================//
// ファイル名   : IAssetResolver.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/27
//
// 概要 : アセットの変換を行うインターフェース
//
// 更新履歴 :
// 2026/07/27 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Common/UUID.h"
#include "Assets/Objects/Handle.h"

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class IAssetResolver
	{

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------
	public:
		virtual ~IAssetResolver() = default;

		virtual UUID GetUUID(const UnTypeHandle&) const = 0;
		virtual UnTypeHandle GetHandle(UUID) const = 0;
	};
}
