//====================================================//
// ファイル名   : SamplerList.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/08/08
//
// 概要 : サンプラーを保持するクラス
//
// 更新履歴 :
// 2026/08/08 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//

#include <unordered_map>
#include "SamplerType.h"

namespace REngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class SamplerList
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

		// サンプラー
		std::unordered_map<SamplerType, Microsoft::WRL::ComPtr<ID3D11SamplerState>> m_samplers;

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		SamplerList() = default;
		~SamplerList() = default;

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// 初期化関数
		void Initialize(ID3D11Device* device);

		//-----------------------------------------------------
		// ゲッター
		//-----------------------------------------------------

		const Microsoft::WRL::ComPtr<ID3D11SamplerState>& GetSampler(SamplerType type) const;

	private:

		//-----------------------------------------------------
		// 内部実装
		//-----------------------------------------------------

		// サンプラーを作成する関数
		void CreateSampler(ID3D11Device* device, SamplerType type, D3D11_FILTER filter, D3D11_TEXTURE_ADDRESS_MODE mode);
	};
}
