//====================================================//
// ファイル名   : UIManager.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/24
//
// 概要 : UI管理クラス
// 　　   Canvasを保持する
//
// 更新履歴 :
// 2026/05/24 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "../Canvas/Canvas.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class UIManager
{
private:

    //-----------------------------------------------------
    // 定数
    //-----------------------------------------------------


    //-----------------------------------------------------
    // メンバ変数
    //-----------------------------------------------------

    // 保持するキャンバスのリスト
    std::vector<std::unique_ptr<Canvas>> m_reserveCanvases;
    std::vector<std::unique_ptr<Canvas>> m_canvases;

	bool m_needSort; // キャンバスの描画順をソートする必要があるか

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    UIManager();
    ~UIManager();

    //-----------------------------------------------------
    // 公開関数
    //-----------------------------------------------------

    void Update(const GameTimer& gameTimer);

    void Draw(Renderer& renderer);

    // キャンバスを生成する関数
	Canvas* CreateCanvas();

    void Reset()
    {
		m_reserveCanvases.clear();
		m_canvases.clear();

		m_needSort = true;
    }

    //-----------------------------------------------------
    // ゲッター
    //-----------------------------------------------------


    //-----------------------------------------------------
    // セッター
    //-----------------------------------------------------

	void SetNeedSort(bool f) { m_needSort = f; }

private:

    //-----------------------------------------------------
    // 内部実装
    //-----------------------------------------------------

    void CheckHitRay();

    void SortCanvas()
    {
        std::stable_sort(
            m_canvases.begin(),
            m_canvases.end(),
            [](const std::unique_ptr<Canvas>& a,
            const std::unique_ptr<Canvas>& b)
            {
                return a->GetDrawOrder()
                     < b->GetDrawOrder();
            });

        m_needSort = false;
    }

    // 予約済みキャンバスを登録する関数
	void RegisterReserveCanvases()
	{
		for (auto& reserve : m_reserveCanvases)
		{
			m_canvases.push_back(std::move(reserve));
		}
		m_reserveCanvases.clear();
	}
};