//====================================================//
// ファイル名   : CircleCollider2D.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/04/17
//
// 概要 : 2Dの円衝突クラス
//
// 更新履歴 :
// 2026/04/17 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "../Collider2D.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class CircleCollider2D : public Collider2D<CircleCollider2D, ComponentID::CircleCollider2D>
{
private:

    //-----------------------------------------------------
    // メンバ変数
    //-----------------------------------------------------

    // 半径
    float m_radius;
public:

    //-----------------------------------------------------
    // 生成 / 破棄
    //-----------------------------------------------------
    CircleCollider2D(IComponentOwner* own)
        : Collider2D(own, ColliderType2D::Circle)
        , m_radius{ 0.5f }
    {
    };
    ~CircleCollider2D() = default;

    //-----------------------------------------------------
    // ゲッター
    //-----------------------------------------------------
    float GetRadius() const
    {
        return m_radius;
    }

    //-----------------------------------------------------
    // セッター
    //-----------------------------------------------------
    void SetRadius(float rad)
    {
        m_radius = rad;
        SetDirty();
    }

    void UpdateCache() const override;
    void DebugDraw(Renderer& renderer, int color) const override;
};