//====================================================//
// ファイル名   : IComponentListener.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/08
//
// 概要 : コンポーネントの読み取り機能を持たせるインターフェース
//
// 更新履歴 :
// 2026/07/08 新規作成
//====================================================//

#pragma once

//====================================================//
// 前方宣言
//====================================================//
class ComponentBase;

//====================================================//
// クラス宣言
//====================================================//
class IComponentListener
{
public:

	//-----------------------------------------------------
	// コンストラクタ / デストラクタ
	//-----------------------------------------------------
	IComponentListener() = default;
	virtual ~IComponentListener() = default;

	//-----------------------------------------------------
	// 公開関数
	//-----------------------------------------------------

	// コンポーネント追加時に通知される関数
	virtual void OnComponentAdded(ComponentBase*) {}

	// コンポーネント削除時に通知される関数
	virtual void OnComponentRemoved(ComponentBase*) {}	
};
