//====================================================//
// ファイル名   : IDebugRenderable.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/10
//
// 概要 : デバッグ描画機能を実装するインターフェース
//
// 更新履歴 :
// 2026/07/10 新規作成
//====================================================//

#pragma once

#include <SimpleMath.h>

namespace REngine
{
	//====================================================//
	// 前方宣言
	//====================================================//
	class Renderer;

	//====================================================//
	// クラス宣言
	//====================================================//
	class IDebugRenderable
	{
	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		IDebugRenderable() = default;
		virtual ~IDebugRenderable() = default;

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		virtual void DebugRender(
			Renderer& renderer,
			const DirectX::SimpleMath::Color& color
		) = 0;
	};
} // namespace REngine
