//====================================================//
// ファイル名   : IResourceReader.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/07/06
//
// 概要 : リソースの読み込みを行うインターフェース
//
// 更新履歴 :
// 2026/07/06 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include <string>

//====================================================//
// クラス宣言
//====================================================//
class IResourceReader
{
public:
	// 扱うリソースの種類
	enum class Type
	{
		Model,
		Texture,
		Sound, 
		Font,
		Object,
	};

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    IResourceReader() = default;
    ~IResourceReader() = default;

    //-----------------------------------------------------
    // ゲッター
    //-----------------------------------------------------

public:
	// 読み込み関数
	bool LoadResource();

	// 読み込みを反映する関数
	virtual void ReflectLoading() = 0;

private:
	// 自身のリソースタイプ
	virtual Type GetType() const = 0;

	// 自身のキー名
	virtual const std::string& GetKeyName() const = 0;

	// 自身のリソースポインタへのアドレス
	virtual void** GetMyResource() const = 0;
};
