//====================================================//
// ファイル名   : IWindowSizeDependent.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/10/22
//
// 概要 : ウィンドウサイズに依存することを明示するインターフェース
//
// 更新履歴 :
// 2026/10/22 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//

namespace RHEngine
{
	//====================================================//
	// クラス宣言
	//====================================================//
	class IWindowSizeDependent
	{
	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		IWindowSizeDependent() = default;
		virtual ~IWindowSizeDependent() = default;

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		// ウィンドウサイズの変更を受け取る関数
		virtual void OnWindowSizeChanged(int width, int height) = 0;
	};
}
