//====================================================//
// ファイル名   : TextUI.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/26
//
// 概要 : 文字列UIコンポーネント
//
// 更新履歴 :
// 2026/05/26 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "../UIGraphic.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class TextUI : public UIGraphic<TextUI, UIComponentID::Text>
{
private:

    //-----------------------------------------------------
    // メンバ変数
    //-----------------------------------------------------

     // 表示文字列
    std::wstring m_text;

    // フォント
    DirectX::SpriteFont* m_pFont;

    // フォントサイズ
    float m_fontSize;

    // 描画設定
    Origin::Type m_origin;

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    TextUI(UIObject* pUIObject)
        : UIGraphic(pUIObject)
		, m_pFont{ nullptr }
        , m_fontSize{ 64 }
        , m_origin{ Origin::Type::LeftTop }
	{
    }
    
    ~TextUI() = default;

    //-----------------------------------------------------
    // 公開関数
    //-----------------------------------------------------

    void Draw(Renderer& renderer) override;

    //-----------------------------------------------------
    // ゲッター
    //-----------------------------------------------------


    //-----------------------------------------------------
    // セッター
    //-----------------------------------------------------

	void SetFont(DirectX::SpriteFont* font) { m_pFont = font; }
    void SetText(const std::wstring& text) { m_text = text; }
    void SetOrigin(Origin::Type origin) { m_origin = origin; }
    void SetFontSize(float size) { m_fontSize = size; }

private:

    //-----------------------------------------------------
    // 内部実装
    //-----------------------------------------------------
};