//====================================================//
// ファイル名  : TemplateComponent.cpp
// 作成者      : Hoshino Ryunosuke
// 作成日       : $shortdate$
//
// 概要       : コンポーネント
//====================================================//

//====================================================//
// インクルードファイル
//====================================================//
#include "pch.h"
#include "TemplateComponent.h"

//====================================================//
// 関数の実体宣言
//====================================================//

void $safeitemname$::Awake()
{}

void $safeitemname$::Start()
{}

void $safeitemname$::Update(const GameTimer & gameTimer)
{}
