//====================================================//
// ファイル名   : UIManager.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/05/24
//
// 概要 : UI管理クラス
// 　　   Canvasを保持する
//
// 更新履歴 :
// 2026/05/24 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "../ReserveContainer.h"
#include "Components/UI/Canvas.h"

namespace REngine
{
	//====================================================//
	// 前方宣言
	//====================================================//
	class Renderer;
	class Scene;

	//====================================================//
	// クラス宣言
	//====================================================//
	class UIManager : public ReserveContainer<Canvas>
	{
	private:

		//-----------------------------------------------------
		// メンバ変数
		//-----------------------------------------------------

	public:

		//-----------------------------------------------------
		// コンストラクタ / デストラクタ
		//-----------------------------------------------------
		UIManager(Scene* pScene);
		~UIManager();

		//-----------------------------------------------------
		// 公開関数
		//-----------------------------------------------------

		void CheckEvent();

		void Draw(Renderer& renderer);

		// マウスとの衝突を調べる関数
		void CheckHitRay(DirectX::SimpleMath::Vector2 position);

		// デバッグ描画関数
		void DebugDraw(Renderer& renderer, DirectX::SimpleMath::Color color);

	private:

		//-----------------------------------------------------
		// 内部実装
		//-----------------------------------------------------

		// キャンバスの並び順をソートする関数
		void SortCanvas();
	};
}	// namespace REngine
